# TabBehind Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePaneState..::..TabBehind Property
DockablePaneState Class See Also
---
Ignored unless %dockPosition% is Tabbed. The new pane will appear in a tab behind the specified existing pane ID.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public DockablePaneId TabBehind { get; set; }
```

Visual Basic
---
```text
Public Property TabBehind As DockablePaneId
	Get
	Set
```

Visual C++
---
```text
public:
property DockablePaneId^ TabBehind {
	DockablePaneId^ get ();
	void set (DockablePaneId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: no dockable pane has been registered with identifier tabBehind. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
DockablePaneState Class
Autodesk.Revit.UI Namespace